<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 09.11.15
 * Time: 07:18
 */

/*
    * Задача 14:
    * Имате предварително въведен едномерен масив, съдържащ реални
    * числа.
    * Да се състави програма, чрез която се избират само елементи със
    * стойности от интервала [-2.99..2.99] и новата редица се извежда на
    * екрана.
    * Пример: 7.1,8.5,0.2,3.7,0.99,1.4,-3.5,-110,212,341,1.2
    * Изход: 0.2; 0.99; 1.4; 1.2
*/

//Enter values
$end = readline('Enter length of array');
for ($i = 0; $i < $end ; $i += 1) {
    $number = readline('Enter element ' . ($i + 1) . ' of array' . PHP_EOL);
    $numbers[] = $number;
}
//$numbers = [7.1,8.5,0.2,3.7,0.99,1.4,-3.5,-110,212,341,1.2];

//Body & print
for ($i = 0; $i < $end ; $i += 1) {
    if ($numbers[$i] > -2.99 &&  $numbers[$i] < 2.99) {
        echo $numbers[$i] . ' ';
    }
}

