<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 21.11.15
 * Time: 19:39
 */

/*
    * Да се състави програма, чрез която по въведен низ съдържащ букви,
    * цифри, знак минус '-' се извежда сборът на въведените числа като се
    * отчита знакът '-' пред съответното число.
    * Вход: asd-12sdf45-56asdf100
    * Изход:
    * -12
    * 45
    * -56
    * 100
    * Сума = 77
*/

//Declaration values
$number = null;
$sum = 0;

//Enter value
$text = readline('Enter your text');

//Body
$text = trim($text, "\n");
$len = mb_strlen($text);
for ($i = 0; $i <= $len ; $i += 1) {                        // Въртим цикъл за да обходим цялата дължина
    $char = mb_substr($text, $i, 1);                        // Взимаме всеки отделен символ
    if ($char == '-' && $number == null) {                  // Проверяваме дали символа е знака минус и дали имаме вече записано число
        $number .= $char;                                   // ако нямаме записваме знака
    } else if ($char == '-' && $number !== null) {          // проверяваме дали знака е минус, и дали имаме записано число
        $sum += $number;                                    // ако има го добавяме към сумата
        $number = $char;                                    // и след това записваме само знака
    } else if ($char > 0 && $char <= 9 || $char === '0') {  // проверяваме дали символа е цифра
        $number .= $char;                                   // ако е цифра го добавяме към числото
    } else {                                                // ако символа не е цифра или знак минус
        $sum += $number;                                    // прибавяме полученото до сега число към сумата
        $number = null;                                     // след което нулираме числото
    }
}

//Print
echo $sum;