<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 20.11.15
 * Time: 07:02
 */
/*
    * Задача 3:
    * Да се състави програма, чрез която се въвеждат последователно две
    * редици от символи без интервали.
    * Програмата да извежда съобщение за резултата от сравнението им по
    * позиции.
 *
    * Пример: хипопотам, хипопотук
 *
    * Изход:
    * Двата низа са с равна дължина.
    * Разлика по позиции:
    * 8 а-у
    * 9 м-к
*/

$word1 = readline('Enter first word');
$word2 = readline('Enter second word');
$word1 = trim($word1,"\n");                     // Премахваме символа за нов ред
$word2 = trim($word2,"\n");                     // Премахваме символа за нов ред

$len1 = mb_strlen($word1);                      // Проверяваме дължината на първата дума
$len2 = mb_strlen($word2);                      // Проверяваме дължината на втората дума

$maxLen = max($len1, $len2);                    // взимаме по-голямата дължина ако не са равни

for ($i = 0; $i < $maxLen ; $i += 1) {          // въртим цикъл до дължжината на по-дългата дума
        $char1 = mb_substr($word1, $i, 1);      // взимаме всеки символ от първата дума
        $char2 = mb_substr($word2, $i, 1);      // взимаме всеки символ от втората дума
        if ($char1 != $char2) {                 // проверяваме дали са едни и същи
            echo $i + 1 . ' ' . $char1          // ако не са принтираме поредният им номер и разминаващите се букви
                . ' - ' . $char2 , PHP_EOL;
        }
}