<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 18.11.15
 * Time: 10:08
 */

/*
    * Задача 7:
    * Имате предварително въведени стойности от естествени числа,
    * въведени в квадратна таблица с размери 6 реда и 6 колони.
    * Да се състави програма , чрез която се намира сумата на всички
    * елементи, чиято сума на индекси за ред и колона е четно число.
    * Програмата да извежда формираните суми за всеки отделен ред на
    * квадратната таблица, както и общата сума от тези елементи.
    * Да се използва само един цикъл.
 *
    * Пример:
    * 11,12,13,14,15,16,
    * 21,22,23,24,25,26,
    * 31,32,33,34,35,36,
    * 41,42,43,44,45,46,
    * 51,52,53,54,55,56,
    * 61,62,63,64,65,66
 *
    * Изход:
    * 11, ,13, ,15, , сума от елементите за реда: 39
    * 22, ,24, ,26, сума от елементите за реда: 72
    * 31, ,33, ,35, , сума от елементите за реда: 99
    * 42, ,44, ,46, сума от елементите за реда: 132
    * 51, ,53, ,55, , сума от елементите за реда: 159
    * 62, ,64, ,66 сума от елементите за реда: 192
    * Сума на елементите: 693
*/

//Declaration variables
$i = 0;
$sumRow = 0;
$totalSum = 0;

$matrix = [
            [11,12,13,14,15,16],
            [21,22,23,24,25,26],
            [31,32,33,34,35,36],
            [41,42,43,44,45,46],
            [51,52,53,54,55,56],
            [61,62,63,64,65,66]
          ];

//Enter values
$rows = readline('Enter size of matrix = ');
$cols = $rows;
/*
for ($i = 0; $i < $rows ; $i += 1) {
    for ($j = 0; $j < $cols; $j += 1) {
        $element = readline('Enter element at position [' . ($i + 1) . '][' . ($j + 1) . ']' . PHP_EOL);
        $matrix[$i][$j] = $element;
    }
}
//Body*/

for ($j = 0; $j <= $cols; $j += 1) {
    if ($j == $cols) {
        $i += 1;
        $j = 0;
        echo ' Sum of row is: ' . $sumRow , PHP_EOL;
        $totalSum += $sumRow;
        $sumRow = 0;
    }
    if ($i == $rows) {
        break;
    }
    if (!(($i + $j) % 2)) {
        $sumRow += $matrix[$i][$j];
        echo $matrix[$i][$j] . ',';
    } else {
        echo ' ,';
    }
}
echo $totalSum;

