<?php require_once "Header.php"; ?>
<h1>Предсмъртното писмо на Левски - сякаш ни гледа и сега от Нѣбето</h1>
    <p class="content">Байовци, Ето, че паднах в ръцете на враговете и ще напусна пътя на борбата преди да сме видели
    края на нашите въжделения. Но с моята кончина не свършва пътят, който трябва да извървите, така щото
    да не изгубят смисъл усилията ни. Моята смърт не ще да спре бъдещето ни освобождение, нито трябва да
    скове сърцата и душите ви. Знайте, че борбата за освобождението ни ще погълне в жертвения си олтар много
    от вас, но още повече ще погълне борбата след освобождението ни. .Аз не веднъж съм ви казвал:
    ” Тоз който ни освободи той ще да ни и пороби”. Внимавайте, в народната работа няма шега,
    освобождението ни трябва да бъде плод на нашите задружни усилия. Вие, които ви грабят, безчестят и
    лъжат днешните ни управници, не мислете, че работата ни свършва с едното освобождение.Не тя с това
    започва. Нашето драгоценно отечество, ще се нуждае от достойни хора, които да го водят по пътя на
    благоденствието, така щото да бъдем равни на другите европейски народи. Ако допуснете утре, когато
    сте вече свободни да ви управляват днешните турски мекерета и разните му лихвари и чорбаджии,
    които и днес ви грабят най-безжалостно, то по-добре да си останем под сянката на султана.
    Вярно е, че ние нямаме хора подготвени, но поне имаме хора честни и родолюбиви, които няма да се
    поколебаят да положат живота си за въздигането на държавата ни.Не се полъгвайте, че тези които държат
    парите държат и бъдещето ви, защото тези пари те са ги взели от вас, а вие им се кланяте и ги въздигате,
    като слънце пред очите си. Те няма да се поколебаят да посегнат към властта, а вие ще трябва да ги
    възпрете и да им поискате сметка, кой с какво е помогнал за освобождението ни, и давал ли е пари или
    казвал нека да стане па тогава. На такива аз съм им писал и преди”. Днес е момента да си купите живот,
    които сега се продава, утре не и милиони да давате”. Та тези, които покажат разписките с печата на
    Централния комитет, те нека живеят свободно в отечеството ни, а другите презрете и отсечете алчните
    им ръце желаещи властта само за да ви грабят.
    За такива злоупотребяващи с народни пари, наказанието е само едно Смърт , смърт и пак смърт,
    както гласи и уставът ни. За тези, които петнят името на отечеството ни наказанието е Смърт,
    смърт и пак смърт. За тези, които се възползват от непросветеността на народа ни и го грабят,
    уж били по-умни и учени, а всъщност лукави и хитри наказанието е Смърт, смърт и пак смърт.
    За тези, които насаждат омраза между хората живеещи в нашето мило Отечество, било на етническа или
    верска основа, с цел докато се избивате по-между си, те да трупат богатства, наказанието е Смърт,
    смърт и пак смърт. За тези, които обещават много, само и само да ги изберете да ви управляват,
    а после се отметнат от думите си, като кажат, че времената били трудни и те видите ли не предполагали
    че такова е положението, наказанието е конфискуване на имуществото и изгнание извън пределите на
    Отечеството ни. За тези, които под булото на родолюбието, градят закони, а самите те не ги спазват
    или пък ги използват с цел своето облагодетелстване, наказанието е Смърт, смърт и пак смърт.
    Това е което исках да ви кажа, надявайки се, че ще доведете борбата до край.Бъдете силни братя и не
    щадете силите ,нито кръвта си, защото Отечеството ни няма да припише заслугите ви другиму,
    нито пък ще позволи да потънат в забвение. И не забравяйте - Времето е в нас и ние сме във времето,
    то нас обръща и ние него обръщаме. Васил Левски1873 г.</p>
<?php require_once "Footer.php";?>