<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 26.10.15
 * Time: 07:19
 */
/*
    * Задача 7:
    * Въведете 3 променливи от конзолата – час, сума пари, дали съм здрав
    * – число със стойност да или не.
    * Съставете програма, която взема решения на базата на тези данни по
    * следния начин:
    *  - ако съм болен няма да излизам
    *  - ако имам пари ще си купя лекарства
    *  - ако нямам – ще стоя вкъщи и ще пия чай
    *  - ако съм здрав ще изляза на кино с приятели
    *  - ако имам по-малко от 10 лв ще отида на кафе
    * Покажете резултата като съобщение в уеб страница.
*/

$health = 0;
$money = 0;
$medicament = 0;
$cinema = 0;
$coffee = 0;
$goOut = 1;
$tea = 0;
if (!$health){
    $goOut = 0;
    if ($money > 0){
        $medicament +=1;
        $health +=1;
    } else {
        $tea +=1;
        $health +=1;
    }
} else {
    if ($money >10){
        $cinema +=1;
    } else {
        $coffee +=1;
    }
}