<?php
/* Задача 18: Дадени са два едномерни масива с естествени числа. Да се състави програма, която сравнява всички числа с еднакви
индекси от двата масива и записва в трети масив, по-голямото от двете числа. Да се изведе съдържанието и на трите масива
Пример:
18,19,32,1,3, 4, 5, 6, 7, 8
 1, 2, 3,4,5,16,17,18,27,11
Изход:
18,19,32,4,5,16,17,18,27,11
 */

$a = [42.25, 45.25, 9.3, 16.8, 0, -38.4, 90.25, 0.8, 0, 1.25];
$b = [0.23, 67, 28, 22.68, -1.45, -0.39, 4.6, 1.8, 0, 92];

$lenA = count($a);
$lenB = count($b);
$c = [];

// Програмата не взема предвид равенство на елементите
for ($i = 0; $i < $lenA; $i++) {
	for ($j = 0; $j < $lenB; $j++) {
		if ($i == $j) {
			if ($a[$i] > $b[$j]) {
				$c[] = $a[$i];
			} else if ($a[$i] < $b[$j]) {
				$c[] = $b[$j];
			}
		}
	}
}

print_r($c);

//В случай на равенство:
// for ($i = 0; $i < $lenA; $i++) {
// 	for ($j = 0; $j < $lenB; $j++) {
// 		if ($i == $j) {
// 			if ($a[$i] >= $b[$j]) {
// 				$c[] = $a[$i];
// 			} else {
// 				$c[] = $b[$j];
// 			}
// 		}
// 	}
// }
// print_r($c);