<?php
/* Задача 12: Да се състави програма, чрез която по предварително въведени 7 числа в едномерен масив 
 * се разменят местата на елементи с индекси:
- 0 и 1 чрез трета променлива;
- 2 и 3 чрез събиране;
- 4 и 5 чрез умножение.
Пример: 1,2,3,4,5,6,7
Изход: 2,1,4,3,6,5,7
 */

// require_once 'readline.php';

// for ($i = 0; $i < 7; $i++) {
// 	$input = readline('Въведете число');

// 	if ($input !== '') {
// 		$a[] = $input;

// 	}
// }

$a = [3, 45, 67, 78, 49, 20, 14];

$j = $a[0];
$a[0] = $a[1]; 
$a[1] = $j;

print_r($a);

$a[2] += $a[3];
$a[3] = $a[2] - $a[3];
$a[2] -= $a[3];

print_r($a);

$a[4] *= $a[5];
$a[5] = $a[4] / $a[5];
$a[4] /= $a[5];

print_r($a);