<?php
/* Задача 16: Да се състави програма, чрез която предварително въведени 10 реални числа от интервала се обработват по следния начин:
1. Извежда съществуващите числа.
2. Всички елементи със стойност по-малки от -0.231 се заменят със сумата от квадрата на индекса им + числото 41.25, 
   а всички останали елементи се заменят с произведението между самия елемент и неговият пореден номер.
3. Да се изведат елементите от началния и новообразувания масив.
4. Да се изведат средната стойност на всички елементи от новата редица, които са различни от 0.
Пример: -1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4
Изход: 42.25, 45.25, 9.3, 16.8, 0, 38.4, 90.25, 68.8, 81.9,141.25
 */

$a = [0.23, 15.7, 28, 2.68, -1.45, -0.39, 4.6, 1.8, 0, 92];

foreach ($a as $value) {
	echo $value, '  ';
}
echo PHP_EOL;

foreach ($a as $key => $value) {
	if ($value < -0.231) {
		$a[$key] = $key*$key + 41.25;
	} else {
		$a[$key] = $value*$key;
	}
	echo $a[$key], '  ';
}

$sum = 0;

foreach ($a as $key => $value) {
	if ($value == 0) {
		unset($a[$key]);
	}
	$sum += $value;
	$len = count($a);
	$avg = $sum/$len;
}

echo PHP_EOL, $avg;

