<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 30.10.15
 * Time: 10:00
 */
/*
Задача 23:
Да се състави програма, която чрез цикъл while извежда
таблицата за умножение, но без повторение.
Т.е. ако е изведено 4*5 не се извежда 5*4.
Пример:
1-ви ред: 1*1; 1*2; 1*3; 1*4; 1*5; 1*6; 1*7; 1*8; 1*9;
2-ри рeд: 2*2; 2*3; 2*4; 2*5; 2*6; 2*7; 2*8; 2*9;                                                                                 тел.: +359 888 911 186
...
9-ти ред: 9*9;
*/

//Body & print
$k = 0;
for ($i = 1; $i < 10; $i += 1){
    $k += 1;
    for ($j = $i; $j < 10; $j += 1){
        echo  $k, '*' , $j , '; ';
    }
    echo PHP_EOL;
}