<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 30.10.15
 * Time: 10:00
 */
/*
Задача 20:
Да се състави програма, чрез която се извежда квадрат от
цифри. Сумите от елементите на произволен ред или стълб са
равни на 45.
Пример:
1 2 3 4 5 6 7 8 9 0
2 3 4 5 6 7 8 9 0 1
3 4 5 6 7 8 9 0 1 2
4 5 6 7 8 9 0 1 2 3
5 6 7 8 9 0 1 2 3 4
6 7 8 9 0 1 2 3 4 5
7 8 9 0 1 2 3 4 5 6
8 9 0 1 2 3 4 5 6 7
9 0 1 2 3 4 5 6 7 8
0 1 2 3 4 5 6 7 8 9
*/

//Body & print
for ($i = 1; $i < 10; $i += 1){
    for ($j = $i; $j < 10; $j += 1){
        echo  $j, ' ';
    }
    $k = ($j - ($j - $i));
    for ($l = 0; $l < $k; $l += 1){
        echo  $l, ' ';
    }
    echo PHP_EOL;
}