<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 30.10.15
 * Time: 10:00
 */

/*
    * Задача 21:
    * Дадено е наредено тесте карти.
    * Наредбата по тежест на карта е: 2,3,4,5,6,7,8,9,10, Вале, Дама,
    * Поп, Асо.
    * Наредбата по цвят на картите е: спатия, каро, купа, пика.
    * Да се създаде програма, чрез която се въвежда N - число от
    * интервала [1..51] и се извеждат въведения номер карта и
    * останалите по-големи карти от тестето.
    * Пример: 47.
    * Изход: Поп купа, Поп пика, Асо спатия, Асо каро, Асо купа, Асо
    * пика
*/

