<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 30.10.15
 * Time: 10:00
 */
/*
    * Задача 19: Да се състави програма, чрез която по въведено
    * естествено число от интервала [10..99] се извежда поредица
    * числа, при спазване на следните изисквания:
    * 1) ако предходното число е четно се извежда 0.5*числото;
    * 2) ако предходното число е нечетно се извежда 3*числото +1.
    * Извеждането продължава докато не се получи стойност 1.
    * Пример: 11
    * Изход: 34 17 52 26 13 40 20 10 5 16 8 4 2 1.
*/

//Enter value
$number = readline('Enter number');

//Body & print
while ($number > 1) {
    if (!($number % 2)) {
        $number *= 0.5;
    } else {
        $number = ($number * 3) + 1;
    }
    echo $number . ' ';
}