<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 30.10.15
 * Time: 10:00
 */

/*
Задача 8: По зададено число n, да се изведе на екрана таблица по
следния начин:
Пример:
|Въведете n:1    |Въведете n:2   |Въведете n:3   |Въведете n:4
|0               |11             |222            |3333
                 |33             |444            |5555
                                 |666            |7777
                                                 |9999
*/


$n = readline('Въведете число' . PHP_EOL);

for ($i = 0; $i < $n; $i++) {
    for ($d=0; $d < $n; $d++){
        $result = ($n - 1) + $i * 2;
        echo $result;
    }
    echo PHP_EOL;
}