<?php
/**
 * Created by PhpStorm.
 * User: just
 * Date: 03.11.15
 * Time: 09:22
 */


// floor                - Винаги закръгля на долу (floor - като под или основа )
// ceil                 - Винаги закръгля на горе
// isset                - връща true ако стойността не е null
// empty                - проверява дали дадената стойност е празна
// unset                - премахва определен/и елемент/и от масива като при премахване на елемента се изтрива
//                         и неговия индекс, но индексите на останалите елементи си запазват индексите
// explode              - обръща стринг в масив
// implode              - превръща масив в стринг
// array_merge          -
// array_diff           - връща всички елементи, които липсват от сравняваните масиви
// array_diff_assoc     - връща всички елементи и ключове, които липсват от сравняваните масиви
// array_intersect      -
// array_intersect_key  -
// array_slice          - използва се за рязане на масиви, като резултата се получава в нов масив         m,.php/**/


$m = 5;
$n = 5;
$array = [];
for ($i = 0; $i < $m ; $i += 1) {
    for ($j = 0; $j < $n ; $j += 1) {
        $array[$m][$n] = 0;
    }
}
for ($i = 0; $i < $m ; $i += 1) {
    for ($j = 0; $j < $n ; $j += 1) {
        echo $array[$m][$n] , PHP_EOL;
    }
    echo PHP_EOL;
}